# ฺฺBMI
"""
< 18 ต่ำกว่าเกณฑ์
18.5 - 22.9 = สมส่วน 
23.0 - 24.9 = น้ำหนักเกิน 
25.0 - 29.9 = โรคอ้วน ระดับที่ 1
>30 = โรคอ้วนระดับอันตราย 
"""
hight = int(input("ป้อนส่วนสูงของคุณ (cm) :"))/100
weight = int(input("ป้อนน้ำหนักของคุณ (kg) :"))
bmi = weight/(hight**2)

if bmi<18 :
    print("ค่่า bmi = ต่ำกว่าเกณฑ์")
elif 18.5>=bmi and bmi <= 22.9:
    print("ค่่า bmi = สมส่วน")
elif 23.0>=bmi and bmi <= 24.9:
    print("ค่่า bmi = น้ำหนักเกิน")
elif 25.0>=bmi and bmi <= 29.9:
    print("ค่่า bmi = น้ำหนักเกิน")
else :
   print("โรคอ้วนระดับอันตราย ")
    


