# ตัวดำเนินการเปรียบเทียบ
# นำข้อมูล 2 ค่ามาเปรียบเทียบกัน
# ชนิดข้อมูลเหมือนกัน
# คำตอบมี 2 คำตอบ => จริง / เท็จ

x,y,z =10,5,17 # กำหนดค่า x,y
print(type(x>y))
print("ค่า x มากกว่า y หรือไม่ : ",x>y)
print("ค่า x น้อยกว่า y หรือไม่ : ",x<y)
print("ค่า x เท่ากับ y หรือไม่ : ", x==y)  # ตัวดำเนินการเปรียบเทียบใช้เครื่องหมาย 2 ตัว
print("ค่า x เท่ากับ y หรือไม่ : ", x!=y)

print("ค่า x มากกว่า หรือ เท่ากับ y หรือไม่ : ", x>=y)
print("ค่า x น้อยกว่า หรือ เท่ากับ y หรือไม่ : ", x<=y)

#และ
print("ค่า x มากกว่า y และ y มากกว่า z หรือไม่ : ".x>y>z )
print("ค่า x น้อยกว่า และ y น้อยกว่า z หรือไม่ : ".x<y<z )

